<?php
# @(#) $Id$

/*
 * п÷п═п∙п■пёп÷п═п∙п√п■п∙п²п≤п∙: п╡я│п╣ я█я┌п╦ я└я┐п╫п╨я├п╦п╦ п╪п╬пЁя┐я┌ п╡я▀п╥я▀п╡п╟я┌я▄я│я▐ я┌п╬п╩я▄п╨п╬ я│ п©п╟я─п╟п╪п╣я┌я─п╟п╪п╦ arg.*,
 * id.*. п÷п╬я│п╨п╬п╩я▄п╨я┐ я█я┌п╦ п©п╟я─п╟п╪п╣я┌я─я▀, п╣я│п╩п╦ п╬п╫п╦ п╬я┌п╪п╣я┤п╣п╫я▀ п╨п╟п╨ я┤п╦я│п╩п╬п╡я▀п╣, я┐п╤п╣ п©я─п╬я┬п╩п╦
 * п╬п╠я─п╟п╠п╬я┌п╨я┐, п╦я┘ п╠п╣п╥п╬п©п╟я│п╫п╬ п╡я│я┌п╟п╡п╩я▐я┌я▄ п╡ SQL-п╬п©п╣я─п╟я┌п╬я─я▀. п■п╩я▐ п╡я│п╣я┘ п╬я│я┌п╟п╩я▄п╫я▀я┘
 * п©п╟я─п╟п╪п╣я┌я─п╬п╡ п╬п╠я─п╟п╠п╬я┌п╨п╟ п╫п╣п╬п╠я┘п╬п╢п╦п╪п╟.
 */
require_once('lib/entries.php');
require_once('lib/postings.php');

function scriptGrpDetails($id) {
    $posting = new Posting(array('id'  => $id,
                                 'grp' => getGrpByEntryId($id)));
    return $posting->getGrpDetailsScript();
}
?>
