<?php
# @(#) $Id$

$rusDow3 = array('Пнд', 'Втр', 'Срд', 'Чтв', 'Птн', 'Суб', 'Вск');
$rusDow3L = array('пнд', 'втр', 'срд', 'чтв', 'птн', 'суб', 'вск');
$rusDow2 = array('Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб', 'Вс');
$rusDow2L = array('пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс');
$rusDow = array('Воскресенье', 'Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница',
                'Суббота');
$rusDowL = array('воскресенье', 'понедельник', 'вторник', 'среда', 'четверг', 'пятница',
                 'суббота');
$rusMonth3 = array(1 => 'Янв', 'Фев', 'Мар', 'Апр', 'Май', 'Июн',
                   'Июл', 'Авг', 'Сен', 'Окт', 'Ноя', 'Дек');
$rusMonth3L = array(1 => 'янв', 'фев', 'мар', 'апр', 'май', 'июн',
                    'июл', 'авг', 'сен', 'окт', 'ноя', 'дек');
$rusMonthI = array(1 => 'Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь',
                   'Июль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь');
$rusMonthIL = array(1 => 'январь', 'февраль', 'март', 'апрель', 'май', 'июнь',
                    'июль', 'август', 'сентябрь', 'октябрь', 'ноябрь', 'декабрь');
$rusMonthR = array(1 => 'Января', 'Февраля', 'Марта', 'Апреля', 'Мая', 'Июня',
                   'Июля', 'Августа', 'Сентября', 'Октября', 'Ноября', 'Декабря');
$rusMonthRL = array(1 => 'января', 'февраля', 'марта', 'апреля', 'мая', 'июня',
                    'июля', 'августа', 'сентября', 'октября', 'ноября', 'декабря');

$jewDow3 = array('Ршн', 'Шен', 'Шлш', 'Рви', 'Хмш', 'Шиш', 'Шаб');
$jewDow3L = array('ршн', 'шен', 'шлш', 'рви', 'хмш', 'шиш', 'шаб');
$jewDow = array('Йом-ришон', 'Йом-шейни', 'Йом-шлиши', 'Йом-рвии', 'Йом-хамиши', 'Йом-шиши', 
                'Шабат');
$jewDowL = array('йом-ришон', 'йом-шейни', 'йом-шлиши', 'йом-рвии', 'йом-хамиши', 'йом-шиши',
                 'шабат');
$jewMonth3 = array(1 => 'Тиш', 'Хеш', 'Кис', 'Тев', 'Швт', 'Ад1', 'Ад2',
                   'Нис', 'Ияр', 'Сив', 'Там', 'Ав', 'Элл', 'Адр');
$jewMonth3L = array(1 => 'тиш', 'хеш', 'кис', 'тев', 'швт', 'ад1', 'ад2',
                    'нис', 'ияр', 'сив', 'там', 'ав', 'элл', 'адр');
$jewMonthI = array(1 => 'Тишрей', 'Хешван', 'Кислев', 'Тевет', 'Шват', 'Адар I', 'Адар II',
                   'Нисан', 'Ияр', 'Сиван', 'Тамуз', 'Ав', 'Элул', 'Адар');
$jewMonthIL = array(1 => 'тишрей', 'хешван', 'кислев', 'тевет', 'шват', 'адар I', 'адар II',
                    'нисан', 'ияр', 'сиван', 'тамуз', 'ав', 'элул', 'адар');
$jewMonthR = array(1 => 'Тишрей', 'Хешвана', 'Кислева', 'Тевета', 'Швата', 'Адара I',
                   'Адара II', 'Нисана', 'Ияра', 'Сивана', 'Тамуза', 'Ава', 'Элула', 'Адара');
$jewMonthRL = array(1 => 'тишрей', 'хешвана', 'кислева', 'тевета', 'швата', 'адара I',
                    'адара II', 'нисана', 'ияра', 'сивана', 'тамуза', 'ава', 'элула', 'адара');
$jewMonthLen = array(1 => 30, 29, 30, 29, 30, 30, 29, 30, 29, 30, 29, 30, 29);

$ejewDow3 = array('Rsh', 'Shn', 'Shl', 'Rvi', 'Hms', 'Shs', 'Shb');
$ejewDow3L = array('rsh', 'shn', 'shl', 'rvi', 'hms', 'shs', 'shb');
$ejewDow = array('Yom-rishon', 'Yom-sheini', 'Yom-shlishi', 'Yom-rvii', 'Yom-hamishi', 'Yom-shishi',
                 'Shabbat');
$ejewDowL = array('yom-rishon', 'yom-sheini', 'yom-shlishi', 'yom-rvii', 'yom-hamishi', 'yom-shishi',
                  'shabbat');
$ejewMonth3 = array(1 => 'Tis', 'Hes', 'Kis', 'Tev', 'Shv', 'Ad1', 'Ad2',
                    'Nis', 'Iyr', 'Siv', 'Tam', 'Av', 'Ell', 'Adr');
$ejewMonth3L = array(1 => 'tis', 'hes', 'kis', 'tev', 'shv', 'ad1', 'ad2',
                     'nis', 'iyr', 'siv', 'tam', 'av', 'ell', 'adr');
$ejewMonthI = array(1 => 'Tishrej', 'Heshvan', 'Kislev', 'Tevet', 'Shvat', 'Adar I', 'Adar II',
                    'Nisan', 'Iyar', 'Sivan', 'Tammuz', 'Av', 'Elul', 'Adar');
$ejewMonthIL = array(1 => 'tishrej', 'heshvan', 'kislev', 'tevet', 'shvat', 'adar i', 'adar ii',
                     'nisan', 'iyar', 'sivan', 'tammuz', 'av', 'elul', 'adar');
?>
